webapp/sample-requests/Appendix_DISCOVER_ROWSETS_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns="urn:schemas-microsoft-com:xml-analysis"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
    <ns1:Discover 
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
        xmlns:ns1="urn:schemas-microsoft-com:xml-analysis">
        <RequestType xsi:type="xsd:string">DISCOVER_SCHEMA_ROWSETS</RequestType>
        <Restrictions>
        <RestrictionList>
        </RestrictionList>
        </Restrictions>
        <Properties>
        <PropertyList>
            <ns1:DataSourceInfo xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">Provider=Mondrian;DataSource=MondrianUab;</ns1:DataSourceInfo>
            <ns1:Catalog xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">uab-prod</ns1:Catalog>
            <ns1:BeginRange xsi:type="xsd:int">0</ns1:BeginRange>
            <ns1:EndRange xsi:type="xsd:int">0</ns1:EndRange>
            <Format xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">Tabular</Format>
            <Content xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">SchemaData</Content>
        </PropertyList>
        </Properties>
    </ns1:Discover>
    </soapenv:Body>
</soapenv:Envelope>

